; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-7-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p0-3 - location
	p2-0 - location
	p3-4 - location
	p4-3 - location
	p4-6 - location
	p4-7 - location
	p4-9 - location
	p5-1 - location
	p5-3 - location
	p7-2 - location
	p7-5 - location
	p7-6 - location
	p7-8 - location
	p8-2 - location
	p9-5 - location
	p9-6 - location
	)
	(:init
	(at driver1 s9)
	(at driver2 s0)
	(at driver3 s1)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s7)
	(empty truck5)
	(at truck6 s6)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at package1 s9)
	(at package2 s9)
	(at package3 s0)
	(at package4 s6)
	(at package5 s2)
	(at package6 s2)
	(at package7 s9)
	(at package8 s0)
	(at package9 s4)
	(at package10 s6)
	(at package11 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 54)
	(= (time-to-walk p0-1 s0) 54)
	(= (time-to-walk s1 p0-1) 35)
	(= (time-to-walk p0-1 s1) 35)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 96)
	(= (time-to-walk p0-3 s0) 96)
	(= (time-to-walk s3 p0-3) 70)
	(= (time-to-walk p0-3 s3) 70)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 37)
	(= (time-to-walk p2-0 s2) 37)
	(= (time-to-walk s0 p2-0) 55)
	(= (time-to-walk p2-0 s0) 55)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 41)
	(= (time-to-walk p3-4 s3) 41)
	(= (time-to-walk s4 p3-4) 7)
	(= (time-to-walk p3-4 s4) 7)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 62)
	(= (time-to-walk p4-6 s4) 62)
	(= (time-to-walk s6 p4-6) 52)
	(= (time-to-walk p4-6 s6) 52)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 32)
	(= (time-to-walk p4-7 s4) 32)
	(= (time-to-walk s7 p4-7) 95)
	(= (time-to-walk p4-7 s7) 95)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(= (time-to-walk s4 p4-9) 84)
	(= (time-to-walk p4-9 s4) 84)
	(= (time-to-walk s9 p4-9) 54)
	(= (time-to-walk p4-9 s9) 54)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 51)
	(= (time-to-walk p5-1 s5) 51)
	(= (time-to-walk s1 p5-1) 67)
	(= (time-to-walk p5-1 s1) 67)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 51)
	(= (time-to-walk p5-3 s5) 51)
	(= (time-to-walk s3 p5-3) 55)
	(= (time-to-walk p5-3 s3) 55)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 45)
	(= (time-to-walk p7-2 s7) 45)
	(= (time-to-walk s2 p7-2) 55)
	(= (time-to-walk p7-2 s2) 55)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 39)
	(= (time-to-walk p7-5 s7) 39)
	(= (time-to-walk s5 p7-5) 27)
	(= (time-to-walk p7-5 s5) 27)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 1)
	(= (time-to-walk p7-6 s7) 1)
	(= (time-to-walk s6 p7-6) 82)
	(= (time-to-walk p7-6 s6) 82)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 1)
	(= (time-to-walk p7-8 s7) 1)
	(= (time-to-walk s8 p7-8) 70)
	(= (time-to-walk p7-8 s8) 70)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 28)
	(= (time-to-walk p8-2 s8) 28)
	(= (time-to-walk s2 p8-2) 16)
	(= (time-to-walk p8-2 s2) 16)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(= (time-to-walk s9 p9-5) 87)
	(= (time-to-walk p9-5 s9) 87)
	(= (time-to-walk s5 p9-5) 69)
	(= (time-to-walk p9-5 s5) 69)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 69)
	(= (time-to-walk p9-6 s9) 69)
	(= (time-to-walk s6 p9-6) 41)
	(= (time-to-walk p9-6 s6) 41)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 3)
	(= (time-to-drive s2 s0) 3)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 64)
	(= (time-to-drive s3 s0) 64)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 10)
	(= (time-to-drive s4 s0) 10)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 40)
	(= (time-to-drive s9 s0) 40)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 19)
	(= (time-to-drive s5 s1) 19)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 50)
	(= (time-to-drive s8 s1) 50)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 46)
	(= (time-to-drive s7 s2) 46)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 80)
	(= (time-to-drive s9 s2) 80)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 2)
	(= (time-to-drive s1 s3) 2)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 77)
	(= (time-to-drive s5 s3) 77)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 75)
	(= (time-to-drive s6 s3) 75)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 85)
	(= (time-to-drive s8 s3) 85)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 30)
	(= (time-to-drive s9 s3) 30)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 25)
	(= (time-to-drive s1 s4) 25)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 52)
	(= (time-to-drive s5 s4) 52)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 81)
	(= (time-to-drive s0 s5) 81)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 80)
	(= (time-to-drive s0 s6) 80)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 96)
	(= (time-to-drive s4 s6) 96)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 35)
	(= (time-to-drive s9 s6) 35)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 18)
	(= (time-to-drive s0 s7) 18)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 23)
	(= (time-to-drive s3 s7) 23)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 36)
	(= (time-to-drive s4 s7) 36)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 99)
	(= (time-to-drive s0 s8) 99)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 24)
	(= (time-to-drive s2 s8) 24)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 6)
	(= (time-to-drive s7 s8) 6)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 27)
	(= (time-to-drive s8 s9) 27)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s5)
	(at truck1 s4)
	(at truck2 s1)
	(at truck3 s5)
	(at truck5 s0)
	(at truck7 s4)
	(at package1 s3)
	(at package2 s4)
	(at package3 s5)
	(at package4 s0)
	(at package5 s3)
	(at package6 s5)
	(at package7 s0)
	(at package8 s8)
	(at package9 s4)
	(at package10 s4)
	(at package11 s4)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 4  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck7 s0)
   deleted: (at driver2 s0) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 2 of 17
2. (load-truck package3 truck7 s0)
   deleted: (at package3 s0)
   added: (in package3 truck7)
   goals met: 2 of 17
3. (load-truck package8 truck7 s0)
   deleted: (at package8 s0)
   added: (in package8 truck7)
   goals met: 2 of 17
4. (drive-truck truck7 s0 s7 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s7)
   changed: (driven) from 0 to 18
   goals met: 2 of 17
5. (walk driver3 s1 p5-1)
   deleted: (at driver3 s1)
   added: (at driver3 p5-1)
   changed: (walked) from 0 to 67
   goals met: 2 of 17
6. (walk driver3 p5-1 s5)
   deleted: (at driver3 p5-1)
   added: (at driver3 s5)
   changed: (walked) from 67 to 118
   goals met: 3 of 17
7. (drive-truck truck7 s7 s2 driver2)
   deleted: (at truck7 s7)
   added: (at truck7 s2)
   changed: (driven) from 18 to 64
   goals met: 3 of 17
8. (load-truck package5 truck7 s2)
   deleted: (at package5 s2)
   added: (in package5 truck7)
   goals met: 3 of 17
9. (drive-truck truck7 s2 s8 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s8)
   changed: (driven) from 64 to 88
   goals met: 3 of 17
10. (unload-truck package8 truck7 s8)
   deleted: (in package8 truck7)
   added: (at package8 s8)
   goals met: 4 of 17
11. (drive-truck truck7 s8 s2 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s2)
   changed: (driven) from 88 to 112
   goals met: 4 of 17
12. (load-truck package6 truck7 s2)
   deleted: (at package6 s2)
   added: (in package6 truck7)
   goals met: 4 of 17
13. (drive-truck truck7 s2 s9 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s9)
   changed: (driven) from 112 to 192
   goals met: 4 of 17
14. (walk driver3 s5 p7-5)
   deleted: (at driver3 s5)
   added: (at driver3 p7-5)
   changed: (walked) from 118 to 145
   goals met: 3 of 17
15. (load-truck package1 truck7 s9)
   deleted: (at package1 s9)
   added: (in package1 truck7)
   goals met: 3 of 17
16. (load-truck package2 truck7 s9)
   deleted: (at package2 s9)
   added: (in package2 truck7)
   goals met: 3 of 17
17. (load-truck package7 truck7 s9)
   deleted: (at package7 s9)
   added: (in package7 truck7)
   goals met: 3 of 17
18. (drive-truck truck7 s9 s6 driver2)
   deleted: (at truck7 s9)
   added: (at truck7 s6)
   changed: (driven) from 192 to 227
   goals met: 3 of 17
19. (load-truck package10 truck7 s6)
   deleted: (at package10 s6)
   added: (in package10 truck7)
   goals met: 3 of 17
20. (load-truck package4 truck7 s6)
   deleted: (at package4 s6)
   added: (in package4 truck7)
   goals met: 3 of 17
21. (drive-truck truck7 s6 s3 driver2)
   deleted: (at truck7 s6)
   added: (at truck7 s3)
   changed: (driven) from 227 to 302
   goals met: 3 of 17
22. (unload-truck package5 truck7 s3)
   deleted: (in package5 truck7)
   added: (at package5 s3)
   goals met: 4 of 17
23. (walk driver3 p7-5 s5)
   deleted: (at driver3 p7-5)
   added: (at driver3 s5)
   changed: (walked) from 145 to 172
   goals met: 5 of 17
24. (drive-truck truck7 s3 s0 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s0)
   changed: (driven) from 302 to 366
   goals met: 5 of 17
25. (unload-truck package4 truck7 s0)
   deleted: (in package4 truck7)
   added: (at package4 s0)
   goals met: 6 of 17
26. (unload-truck package7 truck7 s0)
   deleted: (in package7 truck7)
   added: (at package7 s0)
   goals met: 7 of 17
27. (walk driver3 s5 p7-5)
   deleted: (at driver3 s5)
   added: (at driver3 p7-5)
   changed: (walked) from 172 to 199
   goals met: 6 of 17
28. (drive-truck truck7 s0 s4 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   changed: (driven) from 366 to 376
   goals met: 7 of 17
29. (unload-truck package2 truck7 s4)
   deleted: (in package2 truck7)
   added: (at package2 s4)
   goals met: 8 of 17
30. (walk driver3 p7-5 s5)
   deleted: (at driver3 p7-5)
   added: (at driver3 s5)
   changed: (walked) from 199 to 226
   goals met: 9 of 17
31. (drive-truck truck7 s4 s1 driver2)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   changed: (driven) from 376 to 401
   goals met: 8 of 17
32. (load-truck package11 truck7 s1)
   deleted: (at package11 s1)
   added: (in package11 truck7)
   goals met: 8 of 17
33. (drive-truck truck7 s1 s8 driver2)
   deleted: (at truck7 s1)
   added: (at truck7 s8)
   changed: (driven) from 401 to 451
   goals met: 8 of 17
34. (drive-truck truck7 s8 s2 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s2)
   changed: (driven) from 451 to 475
   goals met: 8 of 17
35. (walk driver3 s5 p7-5)
   deleted: (at driver3 s5)
   added: (at driver3 p7-5)
   changed: (walked) from 226 to 253
   goals met: 7 of 17
36. (drive-truck truck7 s2 s0 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s0)
   changed: (driven) from 475 to 478
   goals met: 7 of 17
37. (drive-truck truck7 s0 s4 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   changed: (driven) from 478 to 488
   goals met: 8 of 17
38. (unload-truck package11 truck7 s4)
   deleted: (in package11 truck7)
   added: (at package11 s4)
   goals met: 9 of 17
39. (drive-truck truck7 s4 s0 driver2)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   changed: (driven) from 488 to 498
   goals met: 8 of 17
40. (walk driver3 p7-5 s5)
   deleted: (at driver3 p7-5)
   added: (at driver3 s5)
   changed: (walked) from 253 to 280
   goals met: 9 of 17
41. (drive-truck truck7 s0 s5 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s5)
   changed: (driven) from 498 to 579
   goals met: 9 of 17
42. (unload-truck package6 truck7 s5)
   deleted: (in package6 truck7)
   added: (at package6 s5)
   goals met: 10 of 17
43. (drive-truck truck7 s5 s3 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s3)
   changed: (driven) from 579 to 656
   goals met: 10 of 17
44. (unload-truck package1 truck7 s3)
   deleted: (in package1 truck7)
   added: (at package1 s3)
   goals met: 11 of 17
45. (drive-truck truck7 s3 s5 driver2)
   deleted: (at truck7 s3)
   added: (at truck7 s5)
   changed: (driven) from 656 to 733
   goals met: 11 of 17
46. (unload-truck package3 truck7 s5)
   deleted: (in package3 truck7)
   added: (at package3 s5)
   goals met: 12 of 17
47. (drive-truck truck7 s5 s4 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s4)
   changed: (driven) from 733 to 785
   goals met: 13 of 17
48. (drive-truck truck7 s4 s7 driver2)
   deleted: (at truck7 s4)
   added: (at truck7 s7)
   changed: (driven) from 785 to 821
   goals met: 12 of 17
49. (disembark-truck driver2 truck7 s7)
   deleted: (driving driver2 truck7)
   added: (at driver2 s7) (empty truck7)
   goals met: 12 of 17
50. (unload-truck package10 truck7 s7)
   deleted: (in package10 truck7)
   added: (at package10 s7)
   goals met: 12 of 17
51. (load-truck package10 truck5 s7)
   deleted: (at package10 s7)
   added: (in package10 truck5)
   goals met: 12 of 17
52. (board-truck driver2 truck7 s7)
   deleted: (at driver2 s7) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 12 of 17
53. (drive-truck truck7 s7 s2 driver2)
   deleted: (at truck7 s7)
   added: (at truck7 s2)
   changed: (driven) from 821 to 867
   goals met: 12 of 17
54. (walk driver3 s5 p7-5)
   deleted: (at driver3 s5)
   added: (at driver3 p7-5)
   changed: (walked) from 280 to 307
   goals met: 11 of 17
55. (disembark-truck driver2 truck7 s2)
   deleted: (driving driver2 truck7)
   added: (at driver2 s2) (empty truck7)
   goals met: 11 of 17
56. (walk driver3 p7-5 s7)
   deleted: (at driver3 p7-5)
   added: (at driver3 s7)
   changed: (walked) from 307 to 346
   goals met: 11 of 17
57. (board-truck driver3 truck5 s7)
   deleted: (at driver3 s7) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 11 of 17
58. (drive-truck truck5 s7 s4 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s4)
   changed: (driven) from 867 to 903
   goals met: 11 of 17
59. (unload-truck package10 truck5 s4)
   deleted: (in package10 truck5)
   added: (at package10 s4)
   goals met: 12 of 17
60. (drive-truck truck5 s4 s0 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (driven) from 903 to 913
   goals met: 13 of 17
61. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 13 of 17
62. (drive-truck truck5 s0 s2 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 913 to 916
   goals met: 12 of 17
63. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 916 to 919
   goals met: 12 of 17
64. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 12 of 17
65. (drive-truck truck3 s0 s2 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 919 to 922
   goals met: 12 of 17
66. (board-truck driver3 truck7 s2)
   deleted: (at driver3 s2) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 12 of 17
67. (drive-truck truck7 s2 s0 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s0)
   changed: (driven) from 922 to 925
   goals met: 12 of 17
68. (drive-truck truck7 s0 s5 driver3)
   deleted: (at truck7 s0)
   added: (at truck7 s5)
   changed: (driven) from 925 to 1006
   goals met: 12 of 17
69. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 12 of 17
70. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 17
71. (drive-truck truck2 s2 s8 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s8)
   changed: (driven) from 1006 to 1030
   goals met: 12 of 17
72. (drive-truck truck2 s8 s1 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (driven) from 1030 to 1080
   goals met: 13 of 17
73. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 13 of 17
74. (drive-truck truck7 s5 s0 driver3)
   deleted: (at truck7 s5)
   added: (at truck7 s0)
   changed: (driven) from 1080 to 1161
   goals met: 13 of 17
75. (drive-truck truck7 s0 s2 driver3)
   deleted: (at truck7 s0)
   added: (at truck7 s2)
   changed: (driven) from 1161 to 1164
   goals met: 13 of 17
76. (disembark-truck driver3 truck7 s2)
   deleted: (driving driver3 truck7)
   added: (at driver3 s2) (empty truck7)
   goals met: 13 of 17
77. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 13 of 17
78. (drive-truck truck3 s2 s0 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 1164 to 1167
   goals met: 13 of 17
79. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 13 of 17
80. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   changed: (walked) from 346 to 401
   goals met: 13 of 17
81. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   changed: (walked) from 401 to 438
   goals met: 13 of 17
82. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 13 of 17
83. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   changed: (walked) from 438 to 473
   goals met: 13 of 17
84. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 13 of 17
85. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   changed: (walked) from 473 to 527
   goals met: 13 of 17
86. (board-truck driver3 truck7 s2)
   deleted: (at driver3 s2) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 13 of 17
87. (drive-truck truck7 s2 s0 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s0)
   changed: (driven) from 1167 to 1170
   goals met: 13 of 17
88. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   changed: (walked) from 527 to 582
   goals met: 13 of 17
89. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   changed: (walked) from 582 to 619
   goals met: 13 of 17
90. (disembark-truck driver3 truck7 s0)
   deleted: (driving driver3 truck7)
   added: (at driver3 s0) (empty truck7)
   goals met: 13 of 17
91. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 13 of 17
92. (board-truck driver2 truck5 s2)
   deleted: (at driver2 s2) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 13 of 17
93. (drive-truck truck3 s0 s5 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (driven) from 1170 to 1251
   goals met: 14 of 17
94. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 15 of 17
95. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 1251 to 1254
   goals met: 16 of 17
96. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 16 of 17
97. (board-truck driver2 truck7 s0)
   deleted: (at driver2 s0) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 16 of 17
98. (drive-truck truck7 s0 s4 driver2)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   changed: (driven) from 1254 to 1264
   goals met: 17 of 17
